Revit 2026 API

# IConnectorRadius Property

---

The radius of the connector.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
double Radius { get; }
```
```vb
ReadOnly Property Radius As Double
	Get
```
```cpp
property double Radius {
	double get ();
}
```
```fsharp
abstract Radius : float with get
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown when the connector's shape is not round. |

This property is used to retrieve the radius of the connector.

#### Reference

IConnector Interface

Autodesk.Revit.DB Namespace